starlingcode/via_archive/Documents/stm32 workspace/onetouchkey/Src/main.c
}

/* USER CODE BEGIN 4 */



void ProcessSensors(void){
	HAL_TSC_IODischarge(&htsc, ENABLE);
    HAL_Delay(1); /* 1 ms is more than enough to discharge all capacitors */

    /*##-3- Start the acquisition process ####################################*/
    if (HAL_TSC_Start(&htsc) != HAL_OK)
    {
      /* Acquisition Error */
      Error_Handler();
    }

    /*##-4- Wait for the end of acquisition ##################################*/
    /*  Before starting a new acquisition, you need to check the current state of
         the peripheral; if it�s busy you need to wait for the end of current
         acquisition before starting a new one. */
    while (HAL_TSC_GetState(&htsc) == HAL_TSC_STATE_BUSY)
    {
      /* For simplicity reasons, this example is just waiting till the end of the
         acquisition, but application may perform other tasks while acquisition
         operation is ongoing. */
    }

    /*##-5- Clear flags ######################################################*/
    __HAL_TSC_CLEAR_FLAG(&htsc, (TSC_FLAG_EOA | TSC_FLAG_MCE));

    /*##-6- Check if the acquisition1 is correct (no max count) ###############*/
    if (HAL_TSC_GroupGetStatus(&htsc, TSC_GROUP1_IDX) == TSC_GROUP_COMPLETED)
    {
      /*##-7- Store the acquisition1 value ####################################*/
      uhTSCAcquisitionValue1 = HAL_TSC_GroupGetValue(&htsc, TSC_GROUP1_IDX);
    }
    /*##-6- Check if the acquisition2 is correct (no max count) ###############*/
        if (HAL_TSC_GroupGetStatus(&htsc, TSC_GROUP2_IDX) == TSC_GROUP_COMPLETED)
        {
          /*##-7- Store the acquisition2 value ####################################*/
          uhTSCAcquisitionValue2 = HAL_TSC_GroupGetValue(&htsc, TSC_GROUP2_IDX);
        }
        /*##-6- Check if the acquisition3 is correct (no max count) ###############*/
            if (HAL_TSC_GroupGetStatus(&htsc, TSC_GROUP3_IDX) == TSC_GROUP_COMPLETED)
            {
              /*##-7- Store the acquisition3 value ####################################*/
              uhTSCAcquisitionValue3 = HAL_TSC_GroupGetValue(&htsc, TSC_GROUP3_IDX);
            }
            }

void SetFlags(void){
	if (uhTSCAcquisitionValue3 < 2320) {
	    	not2 = 1;
	    	not1 = 1;}
	    else {
	    	not2 = 0;
	        not1 = 0;};
	    if (uhTSCAcquisitionValue1 < 1845) {
	        	not3 = 1;
	        	not2 = 1;}
	        else {
	        	not3 = 0;
	            not2 = 0;};
	    if (uhTSCAcquisitionValue2 < 2300) {
	           	not3 = 1;
	           	not1 = 1;}
	           else {
	           	not3 = 0;
	            not1 = 0;};
	    if (not1 == 0 && not2 == 1 && not3 == 0) {flag1 = 1;
	    		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_SET);}
	    else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_6, GPIO_PIN_RESET);
	    		flag1 = 0;}
	    if (not1 == 1 && not2 == 0 && not3 == 1) {flag2 = 1;
	        		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);}
	        else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);
	        			flag2 = 0;}
	    if (not1 == 1 && not2 == 1 && not3 == 1) {flag3 = 1;
	            		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_SET);}
	            else {HAL_GPIO_WritePin(GPIOC, GPIO_PIN_8, GPIO_PIN_RESET);
	            		flag3 = 0;}
}

void ChangeMode(void) {
		if (flag1 > temp1) {
			speed = (speed + 1) % 2;
		}
		if (flag2 > temp2) {
			trigmode = (trigmode + 1) % 5;
		}
		if (flag3 > temp3) {
			loop = (loop + 1) % 2;
		}
		temp1 = flag1;
		temp2 = flag2;
		temp3 = flag3;
}
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
